Revit 2024 API
InitialIntensity.InitialIntensityValue Property
 The calculated initial intensity value.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double InitialIntensityValue { get; }
Visual Basic
Public ReadOnly Property InitialIntensityValue As Double
	Get
Visual C++
public:
property double InitialIntensityValue {
	double get ();
}
See Also
InitialIntensity Class
Autodesk.Revit.DB.Lighting Namespace